ТОИР_демо/src/Documents/торо_УстановкаМинимальногоОстаткаНоменклатуры/торо_УстановкаМинимальногоОстаткаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УстановкаМинимальногоОстаткаНоменклатуры</name>
  <registerRecords>InformationRegister.торо_МинимальныеОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/InformationRegisters/торо_МинимальныеОстаткиНоменклатуры/торо_МинимальныеОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МинимальныеОстаткиНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>МинимальныйОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Documents/торо_УстановкаМинимальногоОстаткаНоменклатуры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СписокТЧ = Новый Структура();
	СписокТЧ.Вставить("Номенклатура", "Номенклатура");
	торо_ОбщегоНазначения.ПроверитьЗаполненностьТабличныхЧастей(ЭтотОбъект, СписокТЧ, Отказ);
	Если отказ тогда возврат; КонецЕсли;	
	
	Движения.торо_МинимальныеОстаткиНоменклатуры.Записывать = Истина;
	
	Для каждого СтрокаНоменклатуры Из Номенклатура Цикл
	
		Движение = Движения.торо_МинимальныеОстаткиНоменклатуры.Добавить();
		
		Движение.Период = ДатаУстановки;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.Номенклатура = СтрокаНоменклатуры.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = СтрокаНоменклатуры.ХарактеристикаНоменклатуры;
		Если ТипЗнч(СтрокаНоменклатуры.ЕдиницаИзмерения) = Тип("СправочникСсылка.УпаковкиНоменклатуры") Тогда
			Движение.МинимальныйОстаток = СтрокаНоменклатуры.МинимальныйОстаток * СтрокаНоменклатуры.ЕдиницаИзмерения.Коэффициент;
		Иначе
			Движение.МинимальныйОстаток = СтрокаНоменклатуры.МинимальныйОстаток;
		КонецЕсли; 	
	КонецЦикла; 
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли
